# GetUIDataItems Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctFittingAndAccessoryPressureDropUIData..::..GetUIDataItems Method
DuctFittingAndAccessoryPressureDropUIData Class See Also
---
Gets all UI data items stored in the UI data.
**Namespace:** Autodesk.Revit.UI.Mechanical**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public IList<DuctFittingAndAccessoryPressureDropUIDataItem> GetUIDataItems()
```

Visual Basic
---
```text
Public Function GetUIDataItems As IList(Of DuctFittingAndAccessoryPressureDropUIDataItem)
```

Visual C++
---
```text
public:
IList<DuctFittingAndAccessoryPressureDropUIDataItem^>^ GetUIDataItems()
```

# ### Return Value
An array of UI data items.
# See Also
DuctFittingAndAccessoryPressureDropUIData Class
Autodesk.Revit.UI.Mechanical Namespace